Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70N20.PIC
      <edc:SFRDef edc:_addr="0x40038674" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038678" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038680" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR0" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038684" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038688" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003868C" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR3" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038690" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR4" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038694" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038698" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003869C" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400386A0" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
