Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70N20.PIC
      <edc:SFRDef edc:_addr="0x400E0618" edc:access="rrrrrrrrrrrrrrrr-------rr-------" edc:cname="PMC_PCSR0" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:desc="Peripheral Clock 7 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral Clock 8 Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral Clock 16 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral Clock 17 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral Clock 18 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral Clock 19 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral Clock 20 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral Clock 21 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral Clock 22 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral Clock 23 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral Clock 24 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral Clock 25 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral Clock 26 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral Clock 27 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral Clock 28 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral Clock 29 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:desc="Peripheral Clock 30 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:desc="Peripheral Clock 31 Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E061C" edc:access="--------nnnn---n----------------" edc:cname="CKGR_UCKR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="UPLLEN" edc:desc="UTMI PLL Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="UPLLCOUNT" edc:desc="UTMI PLL Start-up Time" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0620" edc:access="-----nnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:cname="CKGR_MOR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOSCXTEN" edc:desc="3 to 20 MHz Crystal Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCXTBY" edc:desc="3 to 20 MHz Crystal Oscillator Bypass" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITMODE" edc:desc="Wait Mode Command (Write-only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCEN" edc:desc="4/8/12 MHz On-Chip RC Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCF" edc:desc="4/8/12 MHz RC Oscillator Frequency Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_4_MHz" edc:desc="The RC oscillator frequency is at 4 MHz (default)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_8_MHz" edc:desc="The RC oscillator frequency is at 8 MHz" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_12_MHz" edc:desc="The RC oscillator frequency is at 12 MHz" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCXTST" edc:desc="3 to 20 MHz Crystal Oscillator Start-up Time" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Write Access Password" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0x37"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MOSCSEL" edc:desc="Main Clock Oscillator Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:desc="Clock Failure Detector Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XT32KFME" edc:desc="32.768 kHz Crystal Oscillator Frequency Monitoring Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0624" edc:access="-------n---n---nnnnnnnnnnnnnnnnn" edc:cname="CKGR_MCFR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MAINF" edc:desc="Main Clock Frequency" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="MAINFRDY" edc:desc="Main Clock Frequency Measure Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RCMEAS" edc:desc="RC Oscillator Frequency Measure (write-only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCSS" edc:desc="Counter Clock Source Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0628" edc:access="--n--nnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="CKGR_PLLAR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DIVA" edc:desc="PLLA Front End Divider" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="_0" edc:desc="Divider output is 0 and PLLA is disabled." edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="Divider is bypassed (divide by 1) and PLLA is enabled." edc:when="(field &amp; 0xFF) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PLLACOUNT" edc:desc="PLLA Counter" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MULA" edc:desc="PLLA Multiplier" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:desc="Must Be Set to 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E062C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0630" edc:access="------------------n---nn-nnn--nn" edc:cname="PMC_MCKR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UPLL_CLK" edc:desc="Divided UPLL Clock is selected" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Processor Clock Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CLK_3" edc:desc="Selected clock divided by 3" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDIV" edc:desc="Master Clock Division" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="EQ_PCK" edc:desc="Master Clock is Prescaler Output Clock divided by 1." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PCK_DIV2" edc:desc="Master Clock is Prescaler Output Clock divided by 2." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PCK_DIV4" edc:desc="Master Clock is Prescaler Output Clock divided by 4." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PCK_DIV3" edc:desc="Master Clock is Prescaler Output Clock divided by 3." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="UPLLDIV2" edc:desc="UPLL Divisor by 2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0634" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0638" edc:access="--------------------nnnn-------n" edc:cname="PMC_USB" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USBS" edc:desc="USB Input Clock Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="USBDIV" edc:desc="Divider for USB Clock" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E063C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0640" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK0" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UPLL_CLK" edc:desc="Divided UPLL Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0644" edc:access="--------------------nnnnnnnn-nnn" edc:cname="PMC_PCK1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UPLL_CLK" edc:desc="Divided UPLL Clock is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
